![png](bookERD.png)

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
connection = "mysql+pymysql://root:root@localhost/books"

In [8]:
engine = create_engine(connection)

In [9]:
if database_exists(connection) == False:
    create_database(connection)
else:
    print("The database already exists")

The database already exists

In [10]:
database_exists(connection)

True

In [18]:
df_users = pd.read_csv('Data/users.csv')

In [12]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [13]:
q = '''SELECT first_name FROM users'''
pd.read_sql(q, engine)

  first_name
0       John
1      Robin
2     Gloria

In [17]:
df_books = pd.read_csv('Data/books.csv')

In [15]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [16]:
q = '''SELECT * FROM books'''
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [19]:
df_authors = pd.read_csv('Data/authors.csv')

In [20]:
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [21]:
q = '''SELECT * FROM authors'''
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [22]:
df_favorites = pd.read_csv('Data/favorites.csv')

In [23]:
df_favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [24]:
q = '''SELECT * FROM favorites'''
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [25]:
q = '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [27]:
q = '''SELECT books.title, favorites.user_id FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = (SELECT users.id FROM users 
WHERE (users.last_name = 'Doe' AND users.first_name = "John"))'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1